import java.util.Scanner;

public class test6 {

    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите эпоху:");
        System.out.println("1.Киевская Русь");
        System.out.println("2.Татаро монгольское Иго");
        System.out.println("3.Российская Империя");
        System.out.println("4.СССР");
        System.out.println("5.Российская Федерация");

        int a = scanner.nextInt();

        if ( a == 1){
            System.out.println("Киевская Русь: Ки́евская Русь, или Древнеру́сское госуда́рство, или Дре́вняя Русь — средневековое государство в Северо-Восточной Европе, оформившееся в IX веке в результате объединения ряда восточнославянских и финно-угорских племён под властью князей династии Рюриковичей.");
            System.out.println("Выберете правителя:");
            System.out.println("1 Рюрик");
            System.out.println("2.Игорь Рюрикович");
            System.out.println("3.Святослав Игорович Рюрикович");
            System.out.println("4.Ярополк Святославович Рюрикович");
            System.out.println("5.Владимир Святославович Рюрикович");
            System.out.println("6.Святополк Владимирович");
            System.out.println("7.Ярослав Владимирович");
            System.out.println("8.Святополк Владимирович");
            System.out.println("9.Ярослав Владимирович");
            System.out.println("10.Изяслав Ярославович");
            System.out.println("11.Всеслав Брячиславич");
            System.out.println("12.Святослав Ярославович");
            System.out.println("13.Всеволод Ярославович");
            System.out.println("14.Святополк Изяславич");
            System.out.println("15.Владимир Всеволодович Мономах");
            System.out.println("16.Мстислав Владимирович Великий");
            System.out.println("17.Ярополк Владимирович");
            System.out.println("18.Вячеслав Владимирович");
            System.out.println("19.Всеволод Ольгович");
            System.out.println("20.Игорь Ольгович");
            System.out.println("21.Изяслав Мстиславич");
            System.out.println("22.Юрий Владимирович Долгорукий");
            System.out.println("23.Вячеслав Владимирович");
            System.out.println("24.Ростислав Мстиславич");
            System.out.println("25.Изяслав Давыдович");
            System.out.println("26.Мстислав Изяславич");
            System.out.println("27.Ростислав Мстиславич");
            System.out.println("28.Изяслав Давыдович");
            System.out.println("29.Владимир Мстиславич");
            System.out.println("30.Мстислав Изяславич");
            System.out.println("31.Глеб Юрьевич");
            System.out.println("32.Михалко Юрьевич");
            System.out.println("33.Роман Ростиславич");
            System.out.println("34.Всеволод Юрьевич Большое Гнездо");
            System.out.println("35.Рюрик Ростиславич");
            System.out.println("36.Ярослав Изяславич");
            System.out.println("37.Святослав Всеволодович");
            System.out.println("38.Ингварь Ярославич");
            System.out.println("39.Ростислав Рюрикович");
            System.out.println("40.Всеволод Святославич Чермный");
            System.out.println("41.Ингварь Ярославич ");
            System.out.println("42.Мстислав Романович Старый");
            System.out.println("43.Владимир Рюрикович");
            System.out.println("44.Изяслав");
            System.out.println("45.Владимир Рюрикович");
            System.out.println("46.Михаил Всеволодович");
            System.out.println("47.Ростислав Мстиславич");
            System.out.println("48.Даниил Романович");
            System.out.println("49.Александр Ярославич Невский");

            int b = scanner.nextInt();

            if  (b == 1){
                System.out.println("Рюрик (ум. 879, Новгородская Русь) — согласно русским летописям и кормчим книгам, варяг, правитель Северо-Западной Руси, новгородский князь и родоначальник русской княжеской, ставшей впоследствии царской, династии Рюриковичей.Согласно рассказу, помещённому в «Повести временных лет» и других летописях под 862 годом, Рюрик был приглашён на княжение (призвание варягов) племенами чуди, словен, кривичей, мери, а также, возможно, веси. Он стал княжить в Ладоге (по версии Ипатьевского извода «Повести временных лет»[6]) или в Новгороде (по версии Новгородской первой летописи младшего извода[7]). Вместе с Рюриком пришли его братья Синеус и Трувор, севшие в других городах, после смерти которых он стал единоличным правителем.\n");
            }
            else if (b == 2){
                System.out.println("Игорь (летописная хронология — ок. 878—945) — киевский князь (по летописи 912—945 годы), муж княгини Ольги и отец Святослава Игоревича, согласно летописной традиции начиная с «Повести временных лет» — сын Рюрика. Первый древнерусский князь, известный по современным ему византийским и западным источникам.");
            }
            else if (b == 3){
                System.out.println("Святослав Игоревич (Свѧтославъ Игоревичь; между 920 и 942) — князь новгородский и Великий князь Киевский с 945 (фактически с 964) по 972 год, прославился как полководец.Формально Святослав стал правителем в трёхлетнем возрасте после гибели в 945 году отца, киевского князя Игоря, но самостоятельное правление началось, как можно судить по косвенным данным, около 961 года (по летописи в 964 году). При Святославе Киевской Русью в значительной мере правила его мать — княгиня Ольга, сначала из-за малолетства Святослава, затем из-за его постоянного пребывания в военных походах. При возвращении из похода на Болгарию Святослав был убит печенегами в 972 году на днепровских порогах.\n");
            }
            else if (b == 4){
                System.out.println("Ярополк Святославович ( 978 или 980 года) — великий князь киевский (972—978 годы), старший сын князя Святослава Игоревича. Погиб в первой междоусобице в роду Рюриковичей.");
            }
            else if (b == 5){
                System.out.println("Владимир Святославович (др.-рус. Володимѣръ Свѧтославичь, около 956[1], неизвестно — 15 июля 1015[2], Берестово[2]) — князь новгородский (969—978), великий князь киевский (978—1015), при котором произошло Крещение Руси.Стал новгородским князем в 970 году, захватил киевский престол в 978 году. В 988 году принял христианство по греческому обряду, а также сделал его государственной религией Киевской Руси. В крещении получил христианское имя Василий. Известен под именами Владимир I, Владимир Святой, Владимир Великий, Красно Солнышко, Владимир Креститель (в церковной истории).\n");
            }
            else if (b == 6){
                System.out.println("Святополк Владимирович (др.-рус. Свѧтопо́лкъ Влади́мировичь, в крещении Пётр, в древнерусской историографии по прозвищу «Окая́нный», ок. 979—1019) — князь туровский (с 988, первый из рода Рюриковичей), великий князь киевский в 1015—1016 и 1018—1019. Сын или племянник-пасынок Владимира Святославича, пришёл к власти после его смерти. По преданию, приказал умертвить своих братьев Бориса и Глеба, а потом ещё одного брата Святослава, за что в истории получил прозвище «Окаянный». Боролся со своим братом Ярославом за власть с помощью польского князя Болеслава, на дочери которого был женат. Потерпел поражение и бежал на Запад, где и умер.");
            }
            else if (b == 7){
                System.out.println("Ярослав Владимирович (в поздней историографической традиции Яросла́в Му́дрый; ок. 978 — 20 февраля 1054, Вышгород) — князь ростовский (987—1010), князь новгородский (1010—1034), великий князь киевский (1016—1018, 1019—1054).Ярослав Владимирович — сын князя Владимира Святославича (из рода Рюриковичей) и полоцкой княжны Рогнеды Рогволодовны, отец, дед и дядя многих правителей Европы. При крещении был наречён Георгием. В Русской православной церкви и Православной церкви Украины почитается как благоверный князь; день памяти — 20 февраля (4 марта) в високосный год или 20 февраля (5 марта) в невисокосные годы.\n");
            }
            else if (b == 8){
                System.out.println("Святополк Владимирович: годы правления 1018 - 1019");
            }
            else if (b == 9){
                System.out.println("Ярослав Владимирович: годы правления 1019 - 1054");
            }
            else if (b == 10){
                System.out.println("Изяслав Ярославович (в крещении Дими́трий[2][3]; 1024—3 октября 1078, Нежатина Нива, близ Чернигова) — князь туровский (до 1054), новгородский князь (1052—1054), великий князь киевский (1054—1068, 1069—1073 и 1077—1078).Родился в 1024 году. Его отцом был Ярослав Мудрый, а матерью жена Ярослава — Ирина (шведская принцесса Ингигерда), он был их вторым сыном после Владимира. Получил от отца стол в Турове. После смерти в 1052 году старшего брата новгородского князя Владимира посадил в Новгороде своего сына Мстислава и по тогдашним династическим правилам, стал наследником киевского стола (хотя Владимир и оставил сына). 20 февраля 1054 года, после смерти отца, стал великим князем киевским.");
            }
            else if (b == 11){
                System.out.println("Всеслав Брячиславич (Всесла́в Ве́щий, Всесла́в Чароде́й; умер 14 апреля 1101) — князь полоцкий с 1044 года, единственный представитель полоцкой ветви Рюриковичей на киевском великокняжеском престоле (1068—1069). Его правление в Полоцке было необычайно длинно (57 лет). Примечателен также как герой «Слова о полку Игореве» и восточнославянского фольклора, где он предстаёт как богатырь и чародей, способный оборачиваться зверем.\n");
            }
            else if (b == 12){
                System.out.println("Святослав Ярославович, в крещении Николай (1027 — 27 декабря 1076, Киев) — третий сын Ярослава Мудрого и Ингигерды Шведской, князь черниговский, с 1073 великий князь киевский. Местночтимый святой (благоверный) Чернигова, память: 21 мая по юлианскому календарю.\n");
            }
            else if (b == 13){
                System.out.println("Всеволод Ярославович (в крещении Андре́й; 1030 — 13 апреля 1093, Вышгород под Киевом) — князь киевский в 1076—1077 и с 1078 до конца жизни, первый правитель Киева, использовавший титул «князь всея Руси» (отразившийся на его печатях).\n");
            }
            else if (b == 14){
                System.out.println("Святополк (Михаил) Изяславич (8 ноября 1050 — 16 апреля 1113) — князь полоцкий (1069—1071), новгородский (1078—1088), туровский (1088—1093), великий князь киевский (1093—1113). Сын великого князя киевского Изяслава Ярославича (возможно незаконнорождённый).\n");
            }
            else if (b == 15){
                System.out.println("Владимир Всеволодович Мономах (др.-рус. Володимиръ (-мѣръ) Мономахъ; в крещении Василий; 1053—19 мая 1125) — князь ростовский (1066—1073), князь смоленский (1073—1078), черниговский (1078—1094), переяславский (1094—1113), великий князь киевский (1113—1125), государственный деятель, военачальник, писатель, мыслитель. На сохранившихся печатях Владимир Мономах использовал также титул архонт всея земли Русской, на манер византийского титула.\n" +
                        "\n");
            }
            else if (b == 16){
                System.out.println("Мстислав Владимирович Великий (в крещении Феодор; сер. февраля 1076 — 15 апреля 1132), в Западной Европе был известен как Гаральд, наречён в честь деда — Гарольда II Годвинсона, последнего англосаксонского короля. Великий князь Киевский (1125—1132), старший сын древнерусского князя Владимира Мономаха и английской принцессы Гиты Уэссекской.\n");
            }
            else if (b == 17){
                System.out.println("Ярополк Владимирович (1082, Чернигов — 18 февраля 1139, Киев) — 4-й или 5-й из 8-и сыновей Владимира Мономаха, князь переяславский, великий князь киевский с 1132. При нём распалось единое Древнерусское государство.Ярополк стал великим князем киевским в 1132 году после смерти старшего брата Мстислава. Под его прямым контролем находился только Киев с окрестностями. Смелый воин и способный полководец, Ярополк был слабым политиком, не сумевшим остановить распад государства на отдельные княжества.\n");
            }
            else if (b == 18){
                System.out.println("Вячеслав Владимирович (ок. 1083 — декабрь 1154) — 5-й или 6-й из 8-и сыновей сын Владимира Мономаха и Гиты Уэссекской. Князь Смоленский (1113—1127), князь Туровский (1127—1132, 1134—1142 и 1143—1146), князь Переяславля-Южного (1132—1134, 1142—1143), великий князь Киевский (c 22 февраля по 4 марта 1139, в июле 1150 и с апреля 1151 по 1154).\")");
            }
            else if (b == 19){
                System.out.println("Всеволод Ольгович (в крещении Кирилл; ок. 1094 — 1 августа 1146) — князь северский (1115—1127), черниговский (1127—1139), великий князь Киевский (1139—1146).");
            }
            else if (b == 20){
                System.out.println("Игорь Ольгович (в крещении — Георгий; в иночестве — Гавриил; в схиме — Игнатий; ? — 9 (по другим сведениям, 19) сентября 1147) — сын Олега Святославича, князя черниговского. Святой Русской православной церкви; память: 5 (18) июня (перенесение мощей) и 19 сентября (2 октября). Представитель династии Ольговичей — ветви Рюриковичей, происходящей от Олега Святославича. Князь Новгород-Северский (1139—1146), Великий князь Киевский (1146).\n");
            }
            else if (b == 21){
                System.out.println("Изяслав Мстиславич (в крещении — Пантелеи́мон) (конец 1090-х годов/начало XII века[4] — 13 ноября 1154) — князь Курский (1125—1129), Полоцкий (1129—1132), Туровский (1132—1134), Волынский (1135—1141), Переяславский (1141—1146) и великий князь Киевский (1146—1149, 1150, 1151—1154).Второй сын новгородского князя Мстислава Владимировича Великого от первого брака с Христиной, дочерью конунга Швеции Инге I Стенкильссона Старшего, внук Владимира Мономаха. Один из первых древнерусских князей, которого летопись (Киевский свод в составе Ипатьевской летописи) называет «царём». Покровитель Климента Смолятича.");
            }
            else if (b == 22){
                System.out.println("Юрий (Георгий Владимирович), по прозвищу Долгорукий(др.-рус. Гюрьги, Дюрьги; 1090-е годы — 15 мая 1157 года, Киев) — князь ростово-суздальский и великий князь киевский, 6-й или 7-й из 8-и сыновей Владимира Всеволодовича Мономаха. При этом князе впервые в летописях упоминается Москва.С 1113 года (по другой версии, с 1096 года) до конца жизни Юрий управлял Ростово-Суздальским княжеством. С 1132 года отстаивал на юге интересы свои и братьев, борясь за Переяславль, а затем и за Киев (за что, вероятно, получил прозвище Долгорукого).");
            }
            else if (b == 23){
                System.out.println("Вячеслав Владимирович: годы правления 1150");
            }
            else if (b == 24){
                System.out.println("Ростислав Мстиславич (в крещении Михаил; ок. 1107/1109[6] — 14 марта 1167) — смоленский князь (1127—1167), князь новгородский (1154), великий князь киевский (1154—1155, 1159—1161, 1161—1167) сын Мстислава, внук Владимира Мономаха. Мать — Христина Шведская, дочь шведского короля Инге Старшего.");
            }
            else if (b == 25){
                System.out.println("Изяслав Давыдович (? — 6 марта 1161) — князь стародубский (1146—1147 год), черниговский князь и Великий князь киевский (1155 год, с 1157 по 1158 год, 1161), третий сын черниговского князя Давыда Святославича.\n");
            }
            else if (b == 26){
                System.out.println("Мстислав Изяславич (в крещении Феодор; ок. 1125/1126[3] или ок. 1132/1135[4] — 19 августа 1170) — князь Переяславский, Луцкий, Волынский и великий князь Киевский, сын Изяслава Мстиславича.Как и его отец, будучи представителем старшей линии Мономаховичей, на протяжении всей своей жизни уступал в старшинстве другим Рюриковичам, тем не менее пользовался симпатиями киевской знати и несколько раз княжил в Киеве, а его основной соперник также окончательно утвердился на престоле только после его смерти и предположительно был отравлен.Активно воевал с половцами, выступавших союзниками черниговских и суздальских князей, с которыми он боролся за власть на Руси.");
            }
            else if (b == 27){
                System.out.println("Ростислав Мстиславич: годы правления 1159 - 1161");
            }
            else if (b == 28){
                System.out.println("Изяслав Давыдович: годы правления 1161");
            }
            else if (b == 29){
                System.out.println("Владимир Мстиславич (1132 — 30 мая 1171) — князь Дорогобужский (1152—1154, 1170—1171), князь Владимиро-Волынский (1154—1157), князь Слуцкий (1162), князь Трипольский (1162—1168), великий князь Киевский (1171).Сын Мстислава Владимировича Великого от второго брака, Мачешич.");
            }
            else if (b == 30){
                System.out.println("Мстислав Изяславич: годы правления 1167 - 1169");
            }
            else if (b == 31){
                System.out.println("Глеб Юрьевич (ум. 20 января 1171) — князь Переяславский и Киевский, сын Юрия Долгорукого от брака с дочерью половецкого хана Аепы, брат Андрея Боголюбского.");
            }
            else if (b == 32){
                System.out.println("Михалко (Михаил) Юрьевич (ок. 1145/1153 — 20 июня 1176) — великий князь владимиро-суздальский (1174, 1175—1176), сын Юрия Долгорукого.");
            }
            else if (b == 33){
                System.out.println("Роман Ростиславич (ок. 1132/1135 —14 июня 1180) — сын Ростислава Мстиславича. Князь Смоленский[3], Новгородский и великий князь Киевский (1171—1173, 1174—1176).");
            }
            else if (b == 34){
                System.out.println("Всеволод Юрьевич Большое Гнездо (в крещении Дмитрий, 1154 — 15 апреля 1212) — великий князь владимирский с 1176 года, до этого в течение 35 дней (с февраля по 24 марта 1173) княжил в Киеве.Всеволод Юрьевич — сын Юрия Долгорукого, младший брат Андрея Боголюбского[1]. При нём Великое княжество Владимирское достигло наивысшего могущества. Получил прозвище «Большое Гнездо», потому что имел большое потомство — 12 детей, в том числе восьмерых сыновей. В российской историографии его иногда называют Всеволодом III. Время правления Всеволода — период наивысшего подъёма Владимиро-Суздальской земли. Причины успеха Всеволода — опора на новые города (Владимир, Переславль-Залесский, Дмитров, Городец, Кострома, Тверь), где боярство до него было относительно слабым, а также опора на новый социальный слой — дворянство. Неизвестный автор «Слова о полку Игореве» отмечал: его войско может «Волгу вёслами расплескать, а Дон шлемами вычерпать». В Лаврентьевской летописи начиная с 1186 года Всеволод именуется «великим князем», в чём сказалось влияние Переяславской летописи (Переславля-Залесского), между тем более ранние события описаны на основе Владимирской летописи.\n");
            }
            else if (b == 35){
                System.out.println("Рюрик Ростиславич (в крещении Василий; ок. 1137/1140 — 19.04.1210/1212) — третий сын Ростислава Мстиславича, князь Новгородский (1170—1171), Овручский (1167—1208, с перерывами), великий князь Киевский (1173, 1180—1181, 1194—1201, 1203—1204, 1205—1206, 1207—1210). Согласно традиционной точке зрения, Черниговский (1210—1212). Согласно другим исследованиям, черниговским князем не был и умер в 1210 годуПерейти к разделу «Последние годы» На протяжении почти 40 лет был лидером смоленской княжеской ветви, в том числе (в 1170-е) в связи с лояльностью своего старшего брата Романа мощнейшим князьям Руси — Андрею Боголюбскому, а затем Святославу Всеволодовичу. Возглавлял борьбу смоленских князей против черниговских за Киев и другие княжеские столы.");
            }
            else if (b == 36){
                System.out.println("Ярослав (в крещении Иоанн) Изяславич(ок. 1133/1136 — после 1173, до 1180) — сын великого князя Изяслава Мстиславича, князь туровский (1146), новгородский (1148—1154), луцкий (с 1157), великий князь киевский (1173—1174 с перерывом).Как политик во многом отличался от своего старшего брата Мстислава, защищавшего Киев в 1169 году. Права Ярослава на Киев не признавали Ольговичи (бывшие в воле Мстислава), ему не симпатизировали киевляне. Ярослав уклонился от борьбы с лидером Ольговичей Святославом Всеволодовичем, отдав Киев своим младшим двоюродным братьям Ростиславичам, старший из которых затем также ушёл от этой борьбы (1176).");
            }
            else if (b == 37){
                System.out.println("Святослав Всеволодович (в крещении, вероятно, Михаил, в иночестве, возможно, Гавриил; ок. 1123 — 25 июля 1194) — князь Новгородский (1140), Туровский (1142, 1154—1155), Волынский (1142—1146), Новгород-Северский (1157—1164), Черниговский (1164—1180), великий князь Киевский (1173, 1176—1180, 1181—1194). Старший сын Всеволода Ольговича и дочери Мстислава Владимировича Великого Агафьи (Марии).");
            }
            else if (b == 38){
                System.out.println("Ингварь Ярославич (ок. 1152 — 1220) — князь луцкий (1180 — ок. 1220), великий князь киевский (1201—1203, 1204, 1212), князь волынский (1209—1210). Сын Ярослава Изяславича и дочери чешского князя Владислава II (от брака с Гертрудой фон Бабенберг).");
            }
            else if (b == 39){
                System.out.println("Ростислав Рюрикович (в крещении Михаил) (7 апреля 1172 — после 1218) — князь Торческий (1195—1205), великий князь Киевский (1204—1205), князь Вышгородский (1205 — после 1218), князь Галицкий (1210). Сын Рюрика Ростиславича от 2-го брака (с дочерью туровского князя Юрия Ярославича Анной).");
            }
            else if (b == 40){
                System.out.println("Всеволод Святославич Чермный (в крещении, возможно, Даниил, ум. 1212) — князь стародубский (1198—1201), князь черниговский (1204—1210, 1212), Великий князь Киевский (1206—1207 и 1210—1212). Средний (третий из пяти) сын Святослава Всеволодовича, князя черниговского. Имел прозвище Чермный (рыжий).Был активным участником борьбы за Киев (сначала в союзе с Рюриком Ростиславичем против Романа Галицкого, а после гибели Романа — против Рюрика Ростиславича) и часто призывал на помощь половцев.");
            }
            else if (b == 41){
                System.out.println("Ингварь Ярославич: годы правления 1212");
            }
            else if (b == 42){
                System.out.println("Мстислав Романович Старый (в крещении Борис; около 1156/1162[1] — 2 июня 1223) — князь псковский (с 1179), белгородский (1206), смоленский (1197—1212), великий князь Киевский (1212—1223). Сын Романа Ростиславича и дочери Святослава Ольговича; происходил из смоленской ветви Мономаховичей.");
            }
            else if (b == 43){
                System.out.println("Владимир Рюрикович (1187 — 3 марта 1239) — князь переяславский (1206—1210[1]), смоленский (1212—1219), овручский (1219—1223, 1236—1239) и великий князь Киевский (1223—1235, 1235—1236). Сын Рюрика Ростиславича.");
            }
            else if (b == 44){
                System.out.println("Изяслав (в крещении, возможно, Филипп Владимирович; по др. данным Мстиславич, в совр. историографии иногда идентифицируется как Изяслав IV) — великий князь Киевский (1235), в ранних летописях упоминаемый без отчества. Отождествляется историками с разными Изяславами, упоминаемыми в других летописных сообщениях.");
            }
            else if (b == 45){
                System.out.println("Владимир Рюрикович: годы правления 1235 - 1236");
            }
            else if (b == 46){
                System.out.println("Михаил Всеволодович (известный также, как Михаи́л Черни́говский, 1179—1246) — князь Переяславский (1206), Новгородский (1224, 1229), Черниговский (1223/1226—1246), Галицкий (1235—1239), Великий князь Киевский (1238—1239, 1241—1243).");
            }
            else if (b == 47){
                System.out.println("Ростислав Мстиславич — (ум. после 1239), великий князь Киевский (1239—1240), князь Смоленский (1240—?). Сын Мстислава Давыдовича или Мстислава Романовича Старого. Ростислав Борисович, по крестильному имени отца, упомянут в связи с киевским съездом 1231 года. Наследный удел Ростиславичей, известный по событиям второй половины XIII века (Мстиславль), также указывает на то, что у Мстислава Старого был сын Ростислав.");
            }
            else if (b == 48){
                System.out.println("Дани́л Романович (др. русск. Данило Романовичь, укр. Данило Романович, лат. Daniel Ruthenorum Rex) (1201, по др. данным 1204 — 1264) — князь галицкий в 1205—1206, 1211—1212, 1229—1231, 1233—1235 и 1238[7]—1264 годах, князь волынский в 1215—1229, 1231—1233 и 1235—1238 годах, великий князь киевский (1240), король Руси с 1253 года, политический деятель, дипломат и полководец, сын Романа Мстиславича (из старшей ветви Мономаховичей) и Ефросиньи-Анны.\").\n");
            }
            else if (b == 49){
                System.out.println("Александр Ярославич Невский (др.-рус. Алеѯандръ Ꙗрославичь, в монашестве Алекси́й; ок. 13 мая 1221 года[1], согласно старой историографической традиции — 30 мая 1220 года[комм. 2], Переславль-Залесский — 14 ноября 1263 года, Городец) — князь Новгородский (1228—1229, 1236—1240, 1241—1252 и 1257—1259), великий князь Киевский (1249—1263), великий князь Владимирский (1252—1263), полководец, святой Русской православной церкви.");
            }


        }
        else if (a == 2){
            System.out.println("Татаро монгольское иго: Монго́ло-тата́рское и́го, татаро-монгольское иго, монгольское иго, татарское иго, ордынское иго — система политической и даннической зависимости русских княжеств от Монгольской империи с 1242 года до конца XV века.");
            System.out.println("Выберете правителя:");
            System.out.println("1 Чингизхан");
            System.out.println("2.Толуй");
            System.out.println("3.Угэдэй");
            System.out.println("4.Дорегене - хатун");
            System.out.println("5.Гуюк");
            System.out.println("6.Огул - Гаймыш");
            System.out.println("7.Мунке");
            System.out.println("8.Ариг - Буга");
            System.out.println("9.Хубилай");

            int c = scanner.nextInt();

            if(c == 1){
                System.out.println("Чингисхан ́(монг. Чингис хаан?, собственное имя — Тэмуджин, Темучин, Темучжин (монг. Тэмүжин, Тэмүүжин) (ок. 1155 или 1162 — 18 или 25 августа 1227 года) — основатель и первый великий хан (каган) Монгольской империи, объединивший разрозненные монгольские и тюркские племена; полководец, организовавший завоевательные походы монголов в Китай, Среднюю Азию, на Кавказ и в Восточную Европу. Основатель самой крупной в истории человечества континентальной империи.После смерти в 1227 году наследниками империи стали его прямые потомки от первой жены Бортэ по мужской линии, так называемые чингизиды.");
            }
            else if (c == 2){
                System.out.println("Толуй, Тулуй (монг. Тулуй, ᠲᠥᠯᠦᠢ?, кит. 拖雷; 1186/1190 или ок. 1193 — 1232) — государственный деятель Монгольской империи, военачальник. Четвёртый, младший сын Чингисхана и Бортэ. Осуществлял регентство в период междуцарствия (1227—1229).Носил прозвание Великий нойон (монг. Екэ-нойон; Их ноён?, ᠶᠡᠬᠡ ᠨᠣᠶᠠᠨ?, тюрк. Улуг-нойон). В 1251 году сыном Мункэ ему был посмертно присвоен императорский титул Ин-у хуан-ди («Доблестный и воинственный император») и храмовое имя Жуй-цзун (кит. 元睿宗). В 1265 году четвёртый сын Толуя, Хубилай, присвоил ему другой посмертный титул — Цзин-сян хуан-ди («Блистательный и помогавший император»).");
            }
            else if (c == 3){
                System.out.println("Угэдэй, Огодай, Огодэй (монг. Өгэдэй хаан?, ᠥᠭᠦᠳᠡᠢ ᠬᠠᠭᠠᠨ?, кит. 窝阔台; ок. 1186 — 11 декабря 1241) — третий сын Чингисхана и Бортэ и преемник своего отца в качестве каана (Великого хана) Монгольской империи (1229—1241). Чингисхан ещё задолго до смерти избрал Угэдэя в качестве преемника, а в сентябре 1229 года этот выбор был утверждён курултаем; до этого момента империей управлял в качестве регента его младший сын Толуй. Угэдэй-каан провёл ряд успешных административных реформ и продолжил экспансионистскую политику Чингисхана. Подобно другим его сыновьям, участвовал в походах на Северный Китай и Среднюю Азию.");
            }
            else if (c == 4){
                System.out.println("Дорегене, Туракина-хатун (конец XII — середина XIII вв.) — жена монгольского хана Угэдэя (1229—1241), мать Гуюк-хана (1246—1248), осуществлявшая регентство в период междуцарствия (1242—1246).");
            }
            else if (c == 5){
                System.out.println("Гуюк (или Гаюк; монг. Гүюг хаан?, ᠭᠦᠶᠦᠭ ᠬᠠᠭᠠᠨ?; 1206 — 1248) — каган Монгольской империи (1246—1248), сын Угэдэя, внук Чингисхана.");
            }
            else if (c == 6){
                System.out.println("Огул-Гаймыш (Огул-Каймиш, ум. 1252) — жена монгольского хана Гуюка (1246—1248), ставшая после его смерти регентом государства.");
            }
            else if (c == 7){
                System.out.println("Мунке, Мункэ, Менгу, Мангу (Манке, в русских летописях Менгу-хан), Мангу-хан (1208 — 11 августа 1259, Чунцин) — четвёртый великий каган (1251—1259) Монгольской империи, внук Чингис-хана, сын Толуя и Соркактани-беги, брат Хубилая, Хулагу (Гулагу) и Ариг-буги.В западном походе монголов (1236—1242) воевал на средней Волге и Северном Кавказе. Буквальное значение имени хана — Вечный хан. Батый в 1240 году отрядил Мангу-хана к Киеву. Татаро-монголы остановились на левом берегу Днепра, на Трубеже у городка Песочного, и предложили Киеву сдаться. Киевляне отвергли предложение, убив его послов, и стали готовиться к упорной обороне, под руководством боярина Димитрия. Войско Батыя обложили город, и после осады захватили его. Во время разорении Киева Батыем Мункэ находился в его войсках.\n");
            }
            else if (c == 8){
                System.out.println("Ариг-Буга, Ариг-Бука (монг. Аригбөх; 1219 — 1266) — младший сын Толуя (младшего сына Чингисхана) и Сорхахтани. Соперник своего брата Хубилая в вопросе престолонаследия трона Монгольской империи.");
            }
            else if (c == 9){
                System.out.println("Хубилай (монг. Хубилай хаан; кит. 忽必烈，23 сентября 1215 — 18 февраля 1294) известный также как Сэцэн-хаган — монгольский хан, основатель монгольского государства Юань, в состав которого входил Китай. На Западе известен благодаря Марко Поло под именем «Кублай-хан»; это имя произносилось также как «Кубилай», или «Кубла» (последнее стало особенно распространённым после поэмы С. Т. Кольриджа «Кубла Хан»).Хубилай сменил своего старшего брата Мунке на посту Кагана в 1260 году, но ему пришлось победить своего младшего брата Ариг-бугу в гражданской войне, которая продолжалась до 1264 года. Этот эпизод ознаменовал начало разобщенности в империи. Реальная власть Хубилая была ограничена Китаем и Монголией, хотя как каган он все ещё имел влияние в Ильханате и, в значительно меньшей степени, в Золотой Орде. Если считать Монгольскую империю в то время в целом, его царство простиралось от Тихого океана до Чёрного моря, от Сибири до нынешнего Афганистана.В 1271 году Хубилай основал династию Юань, которая управляла современной   Монголией, Китаем, Кореей и некоторыми прилегающими районами, и принял на себя роль императора Китая. К 1279 году монгольское завоевание династии Сун было завершено, а Хубилай стал первым неханьским императором, покорившим весь Китай. Императорский портрет Хубилая был частью альбома портретов императоров и императриц Юань, который сейчас находится в собрании Национального дворца-музея в Тайбэе. Белый, цвет королевского костюма Хубилая, был императорским цветом династии Юань.\n");
            }

        }
        else if (a == 3){
            System.out.println("Российская империя — государство, существовавшее в период с 22 октября 1721 года до Февральской революции и провозглашения республики в сентябре 1917 года Временным правительством. ");
            System.out.println("Выберете правителя:");
            System.out.println("1 Пётр I");
            System.out.println("2.Екатерина I");
            System.out.println("3.Пётр II");
            System.out.println("4.Анна Иоанновна");
            System.out.println("5.Иван VI");
            System.out.println("6.Елизавета Петровна");
            System.out.println("7.Пётр III");
            System.out.println("8.Екатерина II Великая");
            System.out.println("9.Павел I");
            System.out.println("10.Александр I");
            System.out.println("11.Николай I");
            System.out.println("12.Александр II");
            System.out.println("13.Александр III");
            System.out.println("14.Николай II");

            int d = scanner.nextInt();

            if(d == 1){
                System.out.println("Пётр I Алексеевич, прозванный Вели́ким (30 мая [9 июня] 1672 года — 28 января [8 февраля] 1725 года) — последний царь всея Руси (с 1682 года) и первый Император Всероссийский (с 1721 года).\n" +
                        "\n" +
                        "Представитель династии Романовых. Был провозглашён царём в 10-летнем возрасте при регентше Софье Алексеевне, стал править самостоятельно с 1689 года. Формальным соправителем Петра был его брат Иван (до своей смерти в 1696 году).");
            }
            else if( d == 2){
                System.out.println("Екатери́на I (Марта Самуиловна Скавронская, в браке Крузе; после принятия православия Екатери́на Алексеевна Михайлова; 5  апреля 1684 — 6 мая 1727, Санкт-Петербург) — императрица всероссийская с 1721 года (как супруга царствующего императора), с 1725 года как правящая государыня; вторая жена Петра I, мать императрицы Елизаветы Петровны.\n" +
                        "\n" +
                        "В её честь Петром I учреждён орден Святой Екатерины (1713) и назван город Екатеринбург на Урале (1723). Имя Екатерины I носит также Екатерининский дворец в Царском Селе (построенный при её дочери Елизавете Петровне).");

            }
            else if( d == 3){
                System.out.println("Пётр II Алексе́евич (12 октября 1715, Санкт-Петербург — 19 января 1730, Москва) — император всероссийский, сменивший на престоле Екатерину I.\n" +
                        "\n" +
                        "Внук Петра I, сын царевича Алексея Петровича и немецкой принцессы Софии-Шарлотты Брауншвейг-Вольфенбюттельской, последний представитель рода Романовых по прямой мужской линии.\n" +
                        "\n" +
                        "Вступил на престол 6 (17) мая 1727, когда ему было всего 11 лет, и умер в 14 лет от оспы. Пётр не успел проявить интереса к государственным делам и самостоятельно фактически не правил. Реальная власть в государстве находилась в руках Верховного тайного совета и в особенности фаворитов юного императора, сначала А. Д. Меншикова, после его низложения — Долгоруковых.");

            }
            else if( d == 4){
                System.out.println("Анна Иоанновна (Анна Ивановна; 28 января [7 февраля] 1693 — 17 октября 1740) — в 1730—1740 годах — императрица Всероссийская из династии Романовых.\n" +
                        "\n" +
                        "Племянница Петра Великого: четвёртая дочь брата Петра I Ивана от его брака с Прасковьей Салтыковой. 31 октября (11 ноября) 1710 года была выдана замуж за герцога Курляндского Фридриха Кеттлера. Овдовевшая через 2,5 месяца после свадьбы Анна была отправлена Петром I в Курляндию. После смерти Петра II (внука Петра Великого) была приглашена в 1730 году на российский престол Верховным тайным советом как монарх с ограниченными (в пользу аристократов — «верховников») полномочиями. При поддержке дворян восстановила абсолютизм, распустив Верховный тайный совет. Время её правления позднее получило название «бироновщина» по имени её фаворита Эрнста Бирона.");

            }
            else if( d == 5){
                System.out.println("Ива́н VI (Иоа́нн Анто́нович) (12 [23] августа 1740, Санкт-Петербург — 5 [16] июля 1764, Шлиссельбург) — император всероссийский из Брауншвейгской ветви династии Романовых. Царствовал с октября 1740 по ноябрь 1741 года, во время Эпохи дворцовых переворотов. Является правнуком Ивана V.\n" +
                        "\n" +
                        "Формально царствовал первый год своей жизни при регентстве сперва Бирона, а затем собственной матери Анны Леопольдовны. Император-младенец был свергнут Елизаветой Петровной, провёл почти всю жизнь в одиночном заключении и уже в царствование Екатерины II был убит охраной в 23-летнем возрасте при попытке его освободить.\n" +
                        "\n" +
                        "В официальных прижизненных источниках упоминается как Иоанн III Антонович, то есть счёт ведётся от первого русского царя Иоанна Грозного; в поздней историографии установилась традиция именовать его Иваном (Иоанном) VI, считая от Ивана I Калиты.");

            }
            else if( d == 6){
                System.out.println("Елизавета Петровна (18 декабря 1709, Коломенское — 25 декабря 1761 [5 января 1762], Санкт-Петербург) — императрица Всероссийская из династии Романовых с 25 ноября (6 декабря) 1741 года по 25 декабря 1761 (5 января 1762), младшая дочь Петра I и Екатерины I.\n" +
                        "\n" +
                        "Правление Елизаветы Петровны отмечено возрождением традиций и идеалов петровского периода, восстановлением Правительствующего сената[5], учреждением Московского университета[6], постройкой грандиозных дворцов и роскошью при дворе, появлением первого банка в Российской империи. Смертная казнь не применялась. В елизаветинскую эпоху Российская империя успешно воевала в войне за австрийское наследство, русско-шведской войне 1741—1743 годов и Семилетней войне. Продолжилось исследование и освоение Сибири.");

            }
            else if( d == 7){
                System.out.println("Пётр III Фёдорович (урождённый Карл Петер Ульрих, нем. Karl Peter Ulrich, полностью нем. Karl Peter Ulrich von Schleswig-Holstein-Gottorf; 10 (21) февраля 1728, Киль — 6 (17) июля 1762, Ропша) — император всероссийский в 1762, первый представитель Гольштейн-Готторпской династии на российском престоле. C 1739 года — владетельный герцог Гольштейн-Готторпский. Внук Петра I — сын его дочери Анны и Карла Фридриха Гольштейн-Готторпского. Внучатый племянник Карла XII — внук его сестры Гедвиги-Софии.\n" +
                        "\n" +
                        "После полугодового царствования свергнут в результате дворцового переворота, возведшего на престол его жену Екатерину II, и вскоре лишился жизни. Личность и деятельность Петра III долгое время расценивались историками единодушно отрицательно, однако затем появился и более взвешенный подход, отмечающий ряд государственных заслуг императора, который продолжал внутреннюю политику Петра I. Во времена правления Екатерины за Петра Фёдоровича выдавали себя многие самозванцы (зафиксировано около сорока случаев), самыми известными из которых были Емельян Пугачёв и Степан Малый в Черногории.");

            }
            else if( d == 8){
                System.out.println("Екатерина II (Екатерина Алексеевна; Екатерина Великая; урождённая София Августа Фредери́ка Ангальт-Цербстская (нем. Sophie Auguste Friederike von Anhalt-Zerbst-Dornburg), в православии Екатерина Алексе́евна; 21 апреля [2 мая] 1729, Штеттин, Пруссия — 6 [17] ноября 1796, Зимний дворец, Санкт-Петербург, Российская империя) — императрица и Самодержица Всероссийская (1762—1796). Монарх просвещённого абсолютизма.\n" +
                        "\n" +
                        "Дочь князя Ангальт-Цербстского, Екатерина взошла на престол в результате дворцового переворота против своего мужа — Петра III, вскоре погибшего при невыясненных обстоятельствах (возможно, он был убит)[7]. Она взошла на престол, следуя прецеденту, созданному Екатериной I, сменившей своего мужа Петра Великого в 1725 году.\n" +
                        "\n" +
                        "Екатерининская эпоха ознаменовалась максимальным закрепощением крестьян и всесторонним расширением привилегий дворянства.\n" +
                        "\n" +
                        "При Екатерине Великой границы Российской империи были значительно раздвинуты на запад (разделы Речи Посполитой) и на юг (присоединение Новороссии, Крыма, отчасти Кавказа).\n" +
                        "\n" +
                        "Система государственного управления при Екатерине Второй впервые со времени Петра I была реформирована. Реформы Екатерины II подготовили трансформацию русского государства и общества в первой четверти XIX века и стали необходимым условием для реформ 1860-х годов.\n" +
                        "\n" +
                        "К концу правления Екатерины II Россия находилась в тяжёлом экономическом кризисе при полном крушении финансовой системы, общая сумма долгов правительства составляла 205 млн руб. Внешние займы Екатерины II и начисленные на них проценты были полностью погашены только в 1891 году.\n" +
                        "\n" +
                        "В культурном отношении Россия окончательно вошла в число великих европейских держав, чему немало способствовала сама императрица, увлекавшаяся литературной деятельностью, собиравшая шедевры живописи и состоявшая в переписке с французскими просветителями. В целом политика Екатерины II и её реформы вписываются в русло просвещённого абсолютизма XVIII века.");

            }
            else if( d == 9){
                System.out.println("Павел I Петро́вич (20 сентября [1 октября] 1754, Санкт-Петербург — 12 [24] марта 1801, Санкт-Петербург[1]) — сын Екатерины II и Петра III, император Всероссийский с 6 (17) ноября 1796 года, 72-й великий магистр Мальтийского ордена с 29 ноября (10 декабря) 1798 года[2][3][4][5]. Правнук Петра I.");

            }
            else if( d == 10){
                System.out.println("Александр I Павлович (12 (23) декабря 1777, Санкт-Петербург — 19 ноября (1 декабря) 1825, Таганрог) — Император и Самодержец Всероссийский (с 12 (24) марта 1801 года), великий князь Финляндский (с 1809 года), царь Польский (с 1815 года), проведший в России умеренно-либеральные реформы. Удостоен особого эпитета в русской историографии — «Благословенный».\n" +
                        "\n" +
                        "Старший сын императора Павла I и Марии Фёдоровны[2].\n" +
                        "\n" +
                        "В начале правления провёл реформы, разработанные Негласным комитетом и М. М. Сперанским. Во внешней политике лавировал между Великобританией и Францией. В 1805—1807 годах участвовал в антифранцузских коалициях. В 1807—1812 годах временно сблизился с Францией. Вёл успешные войны с Турцией (1806—1812), Персией (1804—1813) и Швецией (1808—1809). При Александре I к России присоединены территории Восточной Грузии (1801), Финляндии (1809), Бессарабии (1812), бывшего герцогства Варшавского (1815). После Отечественной войны 1812 года возглавил в 1813—1814 годах антифранцузскую коалицию. Победитель Наполеона I Бонапарта: 31 марта 1814 года коалиционные войска под предводительством Александра I вступили в Париж. Был одним из руководителей Венского конгресса 1814—1815 годов и основателей Священного союза.\n" +
                        "\n" +
                        "В последние годы жизни нередко говорил о намерении отречься от престола и «удалиться от мира», что после его неожиданной смерти в Таганроге породило легенду о «старце Фёдоре Кузьмиче». Согласно этой легенде, в Таганроге умер и был затем похоронен не Александр, а его двойник, в то время как император ещё долго жил старцем-отшельником на Урале в пещере на берегу реки Сим и скончался в 1864 году[3].");

            }
            else if( d == 11){
                System.out.println("Николай I (25 июня [6 июля] 1796, Царское Село, Российская империя — 18 февраля [2 марта] 1855, Санкт-Петербург, Российская империя) — император Всероссийский с 19 ноября (1 декабря) 1825 по 18 февраля (2 марта) 1855, царь Польский (единственный коронованный польский монарх из числа Всероссийских императоров[3]) и великий князь Финляндский. Третий сын императора Павла I и Марии Фёдоровны, родной брат императора Александра I, отец императора Александра II.");

            }
            else if( d == 12){
                System.out.println("Александр II Николаевич (17 апреля 1818, Москва — 1 марта 1881, Санкт-Петербург) — Император Всероссийский, Царь Польский и Великий князь Финляндский (1855—1881) из династии Романовых, проводивший широкомасштабные реформы. Старший сын сначала великокняжеской, а с 1825 года — императорской четы Николая Павловича и Александры Фёдоровны.\n" +
                        "\n" +
                        "Удостоен особого эпитета в русской и болгарской историографии — Освободитель (в связи с отменой крепостного права и победой в Русско-турецкой войне (1877—1878), соответственно). За непоследовательность в реформаторской политике и репрессии, в радикальной революционной среде получил прозвище Вешатель. Погиб в результате террористического акта, организованного тайной революционной организацией «Народная воля».");

            }
            else if( d == 13){
                System.out.println("Александр III Александрович (26 февраля [10 марта] 1845, Аничков дворец, Санкт-Петербург — 20 октября [1 ноября] 1894, Ливадийский дворец, Крым) — император Всероссийский, царь Польский и великий князь Финляндский с 1 [13] марта 1881 года. Консерватор, проводивший контрреформы, а также русификацию нацокраин. При его правлении Россия не вела ни одной войны[15]. Заключил франко-русский союз. За внешнеполитическое спокойствие при его правлении получил прозвище Миротворец.\n" +
                        "\n" +
                        "Сын императора Александра II[16] и внук Николая I; отец последнего российского монарха Николая II.");

            }
            else if( d == 14){
                System.out.println("Николай II Александрович (6 мая 1868, Царское Село — 17 июля 1918, Екатеринбург) — император Всероссийский, царь Польский и великий князь Финляндский (20 октября [1 ноября] 1894 — 2 [15] марта 1917). Из императорского дома Романовых. Полковник гвардии (1892); кроме того, от британских монархов имел звания адмирала флота Королевского ВМФ Великобритании (28 мая [10 июня] 1908 года[3][4]) и фельдмаршала британской армии (18 [31] декабря 1915 года[прим 2]). Правление Николая II было ознаменовано экономическим развитием России и одновременно ростом в ней социально-политических противоречий, революционного движения, вылившегося в революцию 1905—1907 годов, Февральскую революцию 1917 года и Октябрьскую революцию; во внешней политике — экспансией на Дальнем Востоке, войной с Японией, а также участием России в военных блоках европейских держав и Первой мировой войне. Николай II отрёкся от престола в ходе Февральской революции в марте 1917 года, после чего находился вместе с семьёй под домашним арестом в Александровском дворце Царского Села. Летом 1917 года по решению Временного правительства был отправлен вместе с семьёй и приближёнными в ссылку в Тобольск, а весной 1918 года перемещён большевиками в Екатеринбург, где в июле 1918 года в подвале дома Ипатьева был расстрелян вместе с семьёй и четырьмя приближёнными.Вместе с женой и детьми был прославлен в лике святых Русской православной церковью как страстотерпец 20 августа 2000 года, ранее, в 1981 году, прославлен Русской зарубежной церковью как мученик.");

            }


        }
        else if (a == 4){
            System.out.println("Сою́з Сове́тских Социалисти́ческих Респу́блик, сокращённо СССР, Сове́тский Сою́з, Сою́з ССР — государство в Евразии, существовавшее с 1922 года по 1991 год.");
            System.out.println("Выберете правителя:");
            System.out.println("1.Владимир Ильич Ленин");
            System.out.println("2.Иосиф Виссарионович Сталин");
            System.out.println("3.Георгий Максимилианович Маленков");
            System.out.println("4.Никита Срегеевич Хрущев");
            System.out.println("5.Леонид Ильич Брежнев");
            System.out.println("6.Юрий Владимирович Андропов");
            System.out.println("7.Константин Устинович Черненко");
            System.out.println("8.Михаил Сергеевич Горбачёв");

            int e = scanner.nextInt();

            if(e == 1){
                System.out.println("Владимир Ильич Ленин (фамилия при рождении — Улья́нов, также известен под двойной фамилией Ульянов-Ленин; 10 (22) апреля 1870, Симбирск, Российская империя — 21 января 1924, Большие Горки, Сухановская волость, Подольский уезд, Московская губерния, РСФСР, СССР) — русский революционер, крупный теоретик марксизма, советский политический и государственный деятель, создатель Российской социал-демократической рабочей партии (большевиков), главный организатор и руководитель Октябрьской революции 1917 года в России, первый председатель Совета народных комиссаров РСФСР и Совета народных комиссаров СССР, создатель первого в мировой истории социалистического государства.\n" +
                        "\n" +
                        "Марксист, публицист, идеолог и создатель Третьего (Коммунистического) интернационала, основатель Союза Советских Социалистических Республик. Сфера основных политико-публицистических работ — материалистическая философия, теория марксизма, антикапитализм и антиимпериализм, теория и практика осуществления социалистической революции, построения социализма и коммунизма (см. Военный коммунизм и НЭП), политическая экономия социализма.\n" +
                        "\n" +
                        "Мнения и оценки исторической роли Владимира Ульянова (Ленина) отличаются крайней полярностью. Вне зависимости от положительной или отрицательной оценки деятельности Ленина даже многие некоммунистические исследователи считают его наиболее значительным революционным государственным деятелем в мировой истории.");

            }
            else if(e == 2){
                System.out.println("Иосиф Виссарионович Сталин (настоящая фамилия — Джугашви́ли, груз. იოსებ ჯუღაშვილი; 6 декабря 1878 (по официальной версии — 9 декабря 1879), Гори, Тифлисская губерния, Российская империя — 5 марта 1953, Ближняя дача, Волынское, Кунцевский район, Московская область, РСФСР, СССР) — российский революционер, советский политический, государственный, военный и партийный деятель.\n" +
                        "\n" +
                        "С 3 апреля 1922 по 10 февраля 1934 года — генеральный секретарь, затем — секретарь ЦК ВКП(б) (с 1952 г. — КПСС), с 19 декабря 1930 года, после занятия должности Вячеславом Молотовым председателя Совета народных комиссаров СССР вместо Алексея Рыкова, фактический руководитель СССР[1][2]. Маршал Советского Союза (1943)[3], Генералиссимус Советского Союза (1945)[4]. Народный комиссар обороны СССР (с 19 июля 1941 года), Председатель Совнаркома СССР и Председатель Государственного комитета обороны СССР.\n" +
                        "\n" +
                        "В 1912 году по предложению В. И. Ленина был включён в ЦК РСДРП. Тогда же Иосиф Джугашвили окончательно избрал себе псевдоним «Сталин». Во время Октябрьской революции, Вторым Всероссийским съездом был избран членом ВЦИК и СНК. В 1922 году на Пленуме ЦК РКП(б) был избран членом Оргбюро и Политбюро ЦК РКП(б), а также Генеральным секретарём ЦК РКП(б) (при нахождении Ленина на должности Председателя СНК СССР). В 1930 году, после ослабления и смерти Ленина, Сталин окончательно вышел победителем из внутрипартийной борьбы, став руководителем государства.\n" +
                        "\n" +
                        "Сталин являлся фактическим основателем тоталитарной диктатуры в СССР. В 1928—1929 годах был инициатором перехода с курса новой экономической политики (НЭПа) на курс индустриализации, коллективизации и построения плановой экономики[10], активизировал политику культурной революции в СССР. С именем Сталина также связывают голод 1932—1933 и 1946—1947 годов, депортацию народов, религиозное преследование, раскулачивание и массовые политические репрессии. С 1937 по 1938 годы Сталин сыграл ключевую роль в «Большом терроре». Лично участвовал в переговорах с министром иностранных дел нацистской Германии Риббентропом перед подписанием договора о ненападении и в переговорах с представителями Финляндии перед Советско-финляндской войной в 1939 году. Во время Великой Отечественной войны осуществлял непосредственное стратегическое руководство советскими вооружёнными силами.");
            }
            else if(e == 3){
                System.out.println("Георгий Максимилианович Маленков (23 ноября [6 декабря] 1901, Оренбург, Оренбургская губерния, Российская империя — 14 января 1988, Москва, РСФСР, СССР) — советский государственный и партийный деятель, соратник И. В. Сталина, председатель Совета Министров СССР (1953—1955). Участник так называемой антипартийной группы (1957).\n" +
                        "\n" +
                        "Член ЦК КПСС (1939—1957), кандидат в члены Политбюро ЦК ВКП(б) (1941—1946), член Политбюро (Президиума) ЦК (1946—1957), член Оргбюро ЦК ВКП(б) (1939—1952), секретарь ЦК КПСС (1939—1946, 1948—1953), депутат Верховного Совета СССР (1938—1958). Фактический руководитель Советского государства в марте 1953 — феврале 1955 года. Курировал ряд важнейших отраслей оборонной промышленности, в том числе создание первой в мире АЭС.");
            }
            else if(e == 4){
                System.out.println("Никита Сергеевич Хрущёв (3 апреля 1894, Калиновка, Дмитриевский уезд, Курская губерния, Российская империя — 11 сентября 1971, Москва, СССР) — советский партийный и государственный деятель. Первый секретарь ЦК КПСС (1953—1964). Председатель Совета министров СССР (1958—1964). Председатель Бюро ЦК КПСС по РСФСР (1956—1964). Герой Советского Союза (1964), Герой Народной Республики Болгария, трижды Герой Социалистического Труда (1954, 1957, 1961), кавалер семи орденов Ленина (1935, 1944, 1948, 1954, 1957, 1961, 1964). Участник Великой Отечественной войны.\n" +
                        "\n" +
                        "Как первый секретарь Московского горкома и обкома ВКП(б), входил по должности в состав тройки НКВД СССР по Московской области (10.07—30.07.1937). Один из трёх советских руководителей, наряду с Михаилом Горбачёвым и Георгием Маленковым, покинувших пост не по причине смерти.\n" +
                        "\n" +
                        "Период правления Хрущёва часто называют «оттепелью»: были выпущены на свободу многие политические заключённые, по сравнению с периодом правления Сталина активность репрессий значительно снизилась. Было отменено уголовное наказание за аборты и опоздания на работу и снят запрет на перемену места работы. Существенно сокращена продолжительность рабочего дня и увеличен оплачиваемый отпуск. Были повышены в три раза государственные закупочные цены на продукцию колхозов. Была проведена денежная реформа, которая позволила стабилизировать экономику страны на десятилетия вперёд. Был принят новый закон о всеобщем пенсионном обеспечении. Было развёрнуто активное жилищное строительство и возвращена архитектура модернизма. Была произведена реформа в сфере транспорта, началось строительство новых магистралей. На железных дорогах была прекращена эксплуатация паровозов (их заменили тепловозы и электровозы). Советский Союз достиг больших успехов в покорении космоса. Вместе с тем с именем Хрущёва связаны и организация самой жёсткой в послевоенный период антирелигиозной кампании, расстрел рабочих в Новочеркасске, судебные процессы с вынесением смертных приговоров против валютчиков и цеховиков, которых советская пропаганда называла «расхитителями социалистической собственности», принятие ошибочных решений в сельском хозяйстве (в частности, просчёты при освоении целины, укрупнение сёл), подавление Венгерского восстания 1956 года, травля Бориса Пастернака и травля художников-авангардистов. Неоднозначно оцениваются решения Хрущева во внешней политике (Карибский кризис). В период его правления усилилось напряжение в отношениях между СССР и США (была самая напряжённая фаза холодной войны). Политика ЦК КПСС под его руководством по десталинизации привела к разрыву с коммунистическими правительствами Энвера Ходжи в Албании и Мао Цзэдуна в Китае. Тем не менее, Китаю было оказано существенное содействие в разработке собственного ядерного оружия и частично переданы имевшиеся в СССР технологии его производства.");
            }
            else if(e == 5){
                System.out.println("Леонид Ильич Брежнев (6 декабря 1906, по другим данным, 19 декабря 1906 [1 января 1907], Каменское, Екатеринославская губерния, Российская империя — 10 ноября 1982, Заречье, Одинцовский район, Московская область, РСФСР, СССР) — советский государственный и партийный деятель, занимавший высшую руководящую должность в КПСС в течение 18 лет (с 1964 и до своей смерти в 1982 году). Участник Великой Отечественной войны, участник Парада Победы на Красной площади 24 июня 1945 года (замполит сводного полка 4-го Украинского фронта).\n" +
                        "\n" +
                        "Председатель Президиума Верховного Совета СССР в 1960—1964 и 1977—1982 годах. Первый секретарь ЦК КПСС в 1964—1966 годах. Генеральный секретарь ЦК КПСС с 1966 по 1982 год. Председатель Бюро ЦК КПСС по РСФСР с 1964 по 1966 год.\n" +
                        "\n" +
                        "Депутат Совета Союза Верховного Совета СССР от Днепропетровской области (3-й созыв, 1950—1954), Казахской ССР (4-й созыв, 1954—1958), Куйбышевской области (5-й созыв, 1958—1962) и Москвы (6—10-е созывы, 1962—1982). В 1974—1977 годах — член Президиума Верховного Совета СССР. Маршал Советского Союза (1976). Член Союза журналистов СССР и Союза писателей СССР.\n" +
                        "\n" +
                        "Герой Социалистического Труда (1961), четырежды Герой Советского Союза (1966, 1976, 1978, 1981), кавалер восьми орденов Ленина. Лауреат Международной Ленинской премии «За укрепление мира между народами» (1973) и Ленинской премии по литературе (1979). В 1978 году награждён орденом «Победа» (в 1989 году это награждение как противоречащее статуту ордена отменено указом за подписью Председателя Верховного Совета СССР М. С. Горбачёва). Всего Брежнев имел 117 советских и иностранных государственных наград.");
            }
            else if(e == 6){
                System.out.println("Юрий Владимирович Андропов (2 июня 1914, станция Нагутская, Ставропольская губерния, Российская империя — 9 февраля 1984, Москва, РСФСР, СССР) — советский государственный и политический деятель, руководитель СССР в 1982—1984 годах. Генеральный секретарь ЦК КПСС (1982—1984), Председатель Президиума Верховного Совета СССР (1983—1984). Председатель Комитета государственной безопасности СССР (1967—1982). Секретарь ЦК КПСС по идеологии в 1982 году и секретарь ЦК КПСС (1962—1967), член Политбюро ЦК КПСС с 1973 года (кандидат с 1967 года). Депутат Верховного Совета СССР 3-го и 6—10-го созывов. Герой Социалистического Труда (1974), кавалер четырёх орденов Ленина (1957, 1964, 1971, 1974).\n" +
                        "\n" +
                        "С 1954 по 1957 год Андропов — посол в Венгрии, участвовал в подавлении Венгерского восстания 1956 года.\n" +
                        "\n" +
                        "10 мая 1967 года назначен председателем КГБ СССР.\n" +
                        "\n" +
                        "После смерти Л. И. Брежнева, последовавшей 10 ноября 1982 года, с 12 ноября 1982 года Юрий Андропов сменил его на посту Генерального секретаря ЦК КПСС, став официальным лидером Советского Союза. Во время своего недолгого (15 месяцев, или 1 год и 98 дней, или 463 дня) пребывания в должности Андропов предпринял ряд мер, направленных на устранение коррупции партийно-государственного аппарата, на повышение экономической эффективности социалистической системы. Против ряда руководителей коммунистической партии были возбуждены уголовные дела, началось расследование. Под лозунгом: «Рабочее время — работе!» началась борьба с прогулами, иногда принимавшая анекдотические формы, вплоть до опроса зрителей в кинотеатрах о месте и времени работы.\n" +
                        "\n" +
                        "В феврале 1983 года, после обострения почечной недостаточности, здоровье Андропова начало быстро ухудшаться, и 9 февраля 1984 года он скончался.");
            }
            else if(e == 7){
                System.out.println("Константин Устинович Черненко (11 сентября 1911, село Большая Тесь, Минусинский уезд, Енисейская губерния, Российская империя — 10 марта 1985, Москва, РСФСР, СССР) — советский партийный и государственный деятель. Генеральный секретарь ЦК КПСС с 13 февраля 1984 по 10 марта 1985, председатель Президиума Верховного Совета СССР с 11 апреля 1984 года (депутат с 1966 года) по 10 марта 1985. Член ВКП(б) с 1931 года, ЦК КПСС — с 1971 года (кандидат с 1966), член Политбюро ЦК КПСС с 1978 года (кандидат с 1977).");
            }
            else if(e == 8){
                System.out.println("Михаил Сергеевич Горбачёв (2 марта 1931, Привольное, Медвеженский район, Северо-Кавказский край, СССР — 30 августа 2022, Москва, Россия) — советский и российский государственный, политический, партийный и общественный деятель.\n" +
                        "\n" +
                        "Последний Генеральный секретарь ЦК КПСС (1985—1991). Последний Председатель Президиума Верховного Совета СССР (1988—1989), затем первый председатель Верховного Совета СССР (1989—1990). Единственный в истории президент СССР (1990—1991)[4]. Основатель Горбачёв-Фонда. С 1993 года и до самой смерти являлся соучредителем издания «Новая газета» и членом редакционного совета, владел 10 % акций издания.\n" +
                        "\n" +
                        "Удостоен множества наград и почётных званий, в том числе Нобелевской премии мира 1990 года. В период деятельности Горбачёва в должности главы государства и руководителя КПСС в Советском Союзе произошли серьёзнейшие изменения, повлиявшие на весь мир и ставшие следствием следующих исторических событий: масштабная попытка реформирования советской системы («Перестройка»); введение в СССР политики гласности, «нового политического мышления», свободы слова и печати, демократических выборов; реформирование социалистической экономики в направлении рыночной модели хозяйствования; окончание Холодной войны; вывод советских войск из Афганистана (1989); распад СССР и Варшавского блока.");
            }


        }
        else if (a == 5){
            System.out.println("Росси́я, или Росси́йская Федера́ция[f] (сокр. РФ[g]), — государство в Восточной Европе и Северной Азии. Россия — крупнейшее государство в мире, её территория в конституционных границах с территорией Крыма, присоединение которого не получило международного признания.");
            System.out.println("Выберете правителя:");
            System.out.println("1.Борис Николаевич Ельцин");
            System.out.println("2.Владимир Владимирович Путин");
            System.out.println("3.Дмитрий Анатольевич Медведев");
            System.out.println("4.Владимир Владимировчи Путин");

            int f = scanner.nextInt();

            if(f == 1){
                System.out.println("Борис Николаевич Ельцин (1 февраля 1931, Бутка, Буткинский район, Уральская область, СССР — 23 апреля 2007, Москва, Россия) — советский и российский партийный, государственный и политический деятель, первый всенародно избранный Президент Российской Федерации (1991—1999); в ноябре 1991 — июне 1992 года одновременно возглавлял правительство. С марта по май 1992 года исполнял обязанности министра обороны Российской Федерации.\n" +
                        "\n" +
                        "Депутат Совета Союза Верховного Совета СССР 10 и 11 созывов (1979—1989); член Президиума Верховного Совета СССР (1984—1988). Народный депутат СССР и член Совета Национальностей Верховного Совета СССР (1989—1990). Народный депутат РСФСР и председатель Верховного Совета РСФСР (1990—1991). Член КПСС (1961—1990), член ЦК КПСС (1981—1990); в партии занимал посты первого секретаря Свердловского обкома КПСС (1976—1985), секретаря ЦК КПСС (1985—1986) и первого секретаря Московского горкома КПСС (1985—1987). Кавалер ордена Ленина (1981).\n" +
                        "\n" +
                        "Вошёл в историю как первый всенародно избранный глава российского государства, радикальный реформатор общественно-политического и экономического устройства России. Период правления Ельцина ознаменовался августовским путчем и распадом Советского Союза в 1991 году, либерализацией цен и приватизацией в начале 1992 года, попытками импичмента в 1993 и 1999 годах, разгоном Верховного Совета и принятием Конституции 1993 года, противостоянием с КПРФ, первой чеченской войной (1994—1996) и началом второй чеченской войны, а также дефолтом в 1998 году.");

            }
            else if(f == 2){
                System.out.println("Владимир Владимирович Путин (род. 7 октября 1952, Ленинград, СССР) — российский государственный, политический и военный деятель. Действующий президент Российской Федерации, председатель Государственного Совета Российской Федерации и верховный главнокомандующий Вооружёнными силами Российской Федерации с 7 мая 2012 года. Ранее занимал должность президента с 7 мая 2000 года по 7 мая 2008 года, также в 1999—2000 и 2008—2012 годах занимал должность председателя правительства Российской Федерации. Кандидат экономических наук (1997).\n" +
                        "\n" +
                        "Выпускник юридического факультета Ленинградского государственного университета (ЛГУ). С 1977 года работал в следственном отделе Управления КГБ СССР по Ленинграду и Ленинградской области. С 1985 по 1990 год служил в резидентуре советской внешней разведки в ГДР. По возвращении в Ленинград работал помощником ректора ЛГУ, затем советником председателя Ленинградского горсовета Анатолия Собчака.\n" +
                        "\n" +
                        "Уволившись из КГБ 20 августа 1991 года, продолжил работу в мэрии Санкт-Петербурга. После поражения Собчака на губернаторских выборах 1996 года переехал в Москву, где был назначен заместителем управляющего делами президента РФ. После пребывания во главе Федеральной службы безопасности РФ и на посту секретаря Совета Безопасности в августе 1999 года возглавил правительство.\n" +
                        "\n" +
                        "Первым лицом государства стал 31 декабря 1999 года, когда после отставки президента России Бориса Ельцина был назначен исполняющим обязанности президента. Впервые избран президентом России 26 марта 2000 года, а затем переизбирался в 2004, 2012 и 2018 годах. Перед выборами 2012 года срок президентских полномочий был увеличен с 4 до 6 лет. После принятия поправок к Конституции Российской Федерации получил право выставлять свою кандидатуру и на президентских выборах в 2024 году.");
            }
            else if(f == 3){
                System.out.println("Дмитрий Анатольевич Медведев (род. 14 сентября 1965, Ленинград, СССР) — российский государственный и политический деятель. Заместитель председателя Совета Безопасности Российской Федерации с 16 января 2020 года. Председатель партии «Единая Россия» с 26 мая 2012 года[5][6]. Президент Российской Федерации (7 мая 2008 — 7 мая 2012). Председатель Правительства Российской Федерации (8 мая 2012 — 15 января 2020). Кандидат юридических наук (1990).\n" +
                        "\n" +
                        "В 2000—2001, 2002—2008 гг. — председатель совета директоров ОАО «Газпром». C 14 ноября 2005 года по 7 мая 2008 года — первый заместитель председателя Правительства Российской Федерации, куратор приоритетных национальных проектов.\n" +
                        "\n" +
                        "10 декабря 2007 года руководители партий «Единая Россия», «Справедливая Россия», «Гражданская сила», «Аграрная партия России» объявили о том, что предлагают кандидатуру Дмитрия Медведева на президентские выборы 2008 года, в тот же день она была поддержана президентом Российской Федерации Владимиром Путиным. 2 марта 2008 года, набрав 70,3 % (52 530 712) голосов принявших в выборах избирателей, избран президентом Российской Федерации.\n" +
                        "\n" +
                        "7 мая 2008 года вступил в должность президента Российской Федерации, став самым молодым президентом в истории современной России (42 года и 7 месяцев).");
            }
            else if(f == 4){
                System.out.println("Владимир Владимирович Путин (род. 7 октября 1952, Ленинград, СССР) — российский государственный, политический и военный деятель. Действующий президент Российской Федерации, председатель Государственного Совета Российской Федерации и верховный главнокомандующий Вооружёнными силами Российской Федерации с 7 мая 2012 года. Ранее занимал должность президента с 7 мая 2000 года по 7 мая 2008 года, также в 1999—2000 и 2008—2012 годах занимал должность председателя правительства Российской Федерации. Кандидат экономических наук (1997).\n" +
                        "\n" +
                        "Выпускник юридического факультета Ленинградского государственного университета (ЛГУ). С 1977 года работал в следственном отделе Управления КГБ СССР по Ленинграду и Ленинградской области. С 1985 по 1990 год служил в резидентуре советской внешней разведки в ГДР. По возвращении в Ленинград работал помощником ректора ЛГУ, затем советником председателя Ленинградского горсовета Анатолия Собчака.\n" +
                        "\n" +
                        "Уволившись из КГБ 20 августа 1991 года, продолжил работу в мэрии Санкт-Петербурга. После поражения Собчака на губернаторских выборах 1996 года переехал в Москву, где был назначен заместителем управляющего делами президента РФ. После пребывания во главе Федеральной службы безопасности РФ и на посту секретаря Совета Безопасности в августе 1999 года возглавил правительство.\n" +
                        "\n" +
                        "Первым лицом государства стал 31 декабря 1999 года, когда после отставки президента России Бориса Ельцина был назначен исполняющим обязанности президента. Впервые избран президентом России 26 марта 2000 года, а затем переизбирался в 2004, 2012 и 2018 годах. Перед выборами 2012 года срок президентских полномочий был увеличен с 4 до 6 лет. После принятия поправок к Конституции Российской Федерации получил право выставлять свою кандидатуру и на президентских выборах в 2024 году.");
            }


        }
        else {
            System.out.println("Информация отсутствует");

        }





        }
    }










